{
    "Sentence Structure and Complexity": "In a nutshell, there are three kinds of centralised proposals: state-centric, hybrid, and stateless. The main argument for centrality is that the current decentralised system causes confusion, namely the existence of different nomenclatures. For instance, 'the APT associated by some researchers with Russia's main intelligence agency (GRU) is known as Sofacy by Kaspersky, as APT28 by FireEye, STRONTIUM by Microsoft, and FANCY BEAR by CrowdStrike' (Davis et al. 2017). Another point is that evidentiary standards could also be established by the centralised institution in question, so that cyber attributions can take place with confidence, credibility, and transparency.",
    "Lexical Choice and Density": "In 2014, the Atlantic Council proposed the creation of a Multilateral Cyber Attribution and Adjudication Council (MCAAC) (Healey et al. 2014). The state-centric proposal would be an ad hoc solution conditioned by state consensus through confidence-building measures. In 2022, the Center for Strategic and International Studies (CSIS) expanded that proposal, recommending collective cyber diplomacy (Lewis 2022). In 2016, Microsoft launched a hybrid proposal for creating a consortium of public and private experts (Smith 2017) with a resemblance to the International Atomic Energy Agency (Mueller et al. 2019). The consortium would operate by cross-checking attributions among private and public entities. In 2017, Rand Corporation proposed a stateless attribution organization (Davis et al. 2017), operated by international team experts.",
    "Use of Passive vs. Active Voice": "In the international arena of cyber security, evidence is often wielded by state actors to substantiate claims of cyberattacks, yet the passive construction of such evidence allows states to retain anonymity and control over their digital arsenals. It has been suggested by experts that a balance is needed between the active engagement of international bodies in cyber incident resolution and the passive stance of individual states, which often obfuscate the clarity of attribution. As the debate intensifies, scholars argue that the employment of both passive and active voice in discussions enhances the robustness and credibility of international cyber norms.",
    "Paragraph Structure": "The most important debate on the attribution problem concerns proposals to solve it. The debate revolves around two kinds of proposals: (1) centralised and (2) decentralised. Concerning the first, the most debated solution is the creation of an international institution which 'should serve as a neutral credible and unbiased authority, embedded with capabilities to attribute cyberattacks' (Kuerbis 2022). Concerning a decentralised system, scholars focus on the establishment of evidentiary standards.",
    "Cohesion and Coherence Mechanisms": "To this end, a nuanced examination of the legal precedents is essential. Moreover, the ongoing discourse on cyberspace governance illustrates the complexity of establishing a universal framework. In this context, the juxtaposition of state-centric and decentralized approaches serves not only to delineate the contours of the debate but also to highlight the intricate interplay of geopolitical, legal, and technical dimensions. Ultimately, the iterative dialogue among stakeholders underscores the imperative for a balanced and adaptable regulatory mechanism, responsive to the evolving cyber landscape.",
    "Formal Tone and Specific Jargon Usage": "In the discourse on cyber deterrence, it is imperative to assimilate the idiosyncrasies of cyber operations and their implications on international security protocols. The lexicon utilized in such discussions is not merely ornamental but serves a pivotal role in articulating the nuanced dynamics of statecraft in the digital realm. Terms such as 'asymmetric cyber threats' and 'strategic cyber defense' are not only indicative of the specialized knowledge inherent within the field but also underscore the necessity for a formalized approach to understanding cyber engagements.",
    "Rhetorical Strategies": "Nevertheless, the present literature review indicates that the debate on cyber attribution is highly complex, incorporating various academic perspectives and methodological approaches. The integration of counterarguments serves not only to illustrate the contentious nature of cyber attribution but also to enhance the discussion by synthesizing diverse viewpoints. This is evident in the way the literature juxtaposes centralized and decentralized systems, weighing their respective merits and challenges, thereby fostering a more nuanced understanding of the attribution dilemma.",
    "Narrative Flow": "Thus, the necessity of establishing a reliable attribution mechanism in cyberspace has been vigorously debated. Building upon this foundation, it is posited that the integration of international norms and standards could significantly enhance the transparency and accountability of cyber operations. This progression logically leads to a discussion on the practical challenges of implementing such norms, which involves the cooperation of multiple stakeholders spanning various sectors and nations. These elements collectively contribute to the development of a robust and cohesive cyber governance framework, ultimately facilitating smoother transitions between topics within the broader discourse on cybersecurity.",
    "Tone Variability": "This research underscores the significance of cyber attribution in understanding the broader implications of state behavior in cyberspace. Notably, the analysis shifts from an assertive tone when discussing the necessity of robust attribution mechanisms to a more speculative tone when considering the potential for international cooperation. Such a modulation in tone is instrumental in engaging a scholarly audience while reflecting on the complex dynamics at play in cyber diplomacy and international security.",
    "Syntax Variety": "The discussion around the challenges of cyber attribution highlights the need for a robust framework that addresses both the technical aspects and the implications for international law and policy. While many argue for a stringent attribution mechanism, others point to the difficulties posed by the anonymity of the cyber realm, advocating instead for a more flexible approach. This ongoing debate not only sheds light on the complexities inherent in cyber operations but also underscores the importance of a balanced dialogue, incorporating diverse perspectives to forge a comprehensive solution.",
    "Pragmatic Markers": "This research underscores the significance of cyber attribution in understanding the broader implications of state behavior in cyberspace. Importantly, the analysis shifts from an assertive tone when discussing the necessity of robust attribution mechanisms to a more speculative tone when considering the potential for international cooperation. Furthermore, it is essential to note that such modulation in tone is instrumental in engaging a scholarly audience while reflecting on the complex dynamics at play in cyber diplomacy and international security.",
    "Question Handling": "As the discourse on cyber attribution advances, one might ask, how can international law adapt to the complexities and evolving nature of cyber threats? This question underpins the discussion on creating robust mechanisms for attribution that align with both technological realities and international legal frameworks. Furthermore, it raises the critical issue of state responsibility in a domain where anonymity often shields perpetrators, suggesting that a reevaluation of legal approaches to cyber incidents is both timely and necessary.",
    "Precision and Clarity": "The argument is to maintain the existing decentralised system with multiple attributors and set evidentiary standards for attribution in a way that cross-checking is facilitated. These works reinforce the idea that national evidentiary standards rarely converge at the international level which hinders the development of international evidentiary standards.",
    "Reference and Citation Style": "Dunn, M. & Kristensen, K. S. (2018). Cyber norms in international relations. In 'Cyber Norms: New Rules for a New Era', eds. Finemore, M. & Kristensen, K. S., Cambridge University Press, 123-145.",
    "Interdisciplinary References": "Indeed cyber-attacks have been showing the potential to inflict considerable damage to numerous critical infrastructures. In 2007 DDoS attacks disrupted the government infrastructure of Estonia (Lesk 2007) proving to be a cyberweapon. In 2009 they targeted an Iranian nuclear plant (Lindsay 2013). In 2016 they interfered in the US elections (Nakashima 2016). As a result, governments, companies, and academics commenced to analyze how to address them out of the scope of computer science and attribution has shown to be the bottleneck of various policies to counter cyberattacks.",
    "Argument Structure": "In 2014, the Atlantic Council proposed the creation of a Multilateral Cyber Attribution and Adjudication Council (MCAAC) (Healey et al., 2014). The state-centric proposal would be an ad hoc solution conditioned by state consensus through confidence-building measures. In 2022, the Center for Strategic and International Studies (CSIS) expanded that proposal, recommending collective cyber diplomacy (Lewis, 2022). Microsoft, in 2016, launched a hybrid proposal for creating a consortium of public and private experts (Smith, 2017), with a resemblance to the International Atomic Energy Agency (Mueller et al., 2019). The consortium would operate by cross-checking attributions among private and public entities. In 2017, Rand Corporation proposed a stateless attribution organization (Davis et al., 2017), operated by international team experts.",
    "Abstract vs. Concrete Writing": "The argument is to maintain the existing decentralised system with multiple attributors and set evidentiary standards for attribution in a way that cross-checking is facilitated. These works reinforce the idea that national evidentiary standards rarely converge at the international level which hinders the development of international evidentiary standards.",
    "Discourse Markers": "The great solution debate revolves around two types of proposals for addressing cyber attribution: centralized and decentralized systems. Centralized proposals include the creation of an international institution to serve as a neutral, credible, and unbiased authority equipped with the capabilities to attribute cyberattacks. On the other hand, decentralized systems focus on the establishment of evidentiary standards to allow for the cross-checking of attributions among different entities. This debate highlights the ongoing discussions and diverse viewpoints within the field regarding the best approach to solve the attribution problem.",
    "Interpersonal Language": "Therefore, this paper aims to review the existing research and relevant debates vis-à-vis cyber attribution. It will attempt to extract one research question in light of IR theories. For that purpose, the present work is divided into six parts: (i) background (ii) Extracting Cyber Attribution Research (iii) Two Waves of Attribution (iv) themes (v) nascent schools of attribution and (vi) the great solution debate.",
    "Consistency in Style": "Cyber attribution studies are in their infancy. For a while, cyber attribution was a concern of computer science professionals who were the only ones responsible for addressing the attribution problem. However, as the rise in sophistication and quantity of cyberattacks commenced to affect nation-states, cyber attribution was no longer left in the hands of computer science professionals. Indeed, cyber-attacks have been showing the potential to inflict considerable damage to numerous critical infrastructures. In 2007, DDoS attacks disrupted the government infrastructure of Estonia (Lesk 2007), proving to be a cyberweapon. In 2009, they targeted an Iranian nuclear plant (Lindsay 2013). In 2016, they interfered in the US elections (Nakashima 2016). As a result, governments, companies, and academics commenced to analyze how to address them out of the scope of computer science and attribution has shown to be the bottleneck of various policies to counter cyberattacks.",
    "Narrative Techniques in Academic Writing": "In the complex and intricate discourse of cyber deterrence, a remarkable narrative unfolds, shedding light on the profound implications of cybersecurity on international politics. The narrative adeptly intertwines historical events with theoretical insights, illustrating the evolution of cyber threats and the corresponding strategies employed by states to mitigate these dangers. The narrative is enriched by a detailed analysis of various national policies and the pivotal role of international cooperation in shaping the landscape of cyber governance. This comprehensive approach not only enhances our understanding of the current challenges but also projects potential future scenarios, urging policymakers to consider innovative solutions to enhance cybersecurity globally.",
    "Strategic Use of Quotations": "The argument is reinforced by the research of Tran (2019), who states that 'states' incentives to attribute are reduced as the provided evidence could make perpetrators learn from their mistakes for future attacks.' This sentiment is echoed by Eichensehr (2019), who further notes the blockages in establishing such standards by major countries like the United States, France, the Netherlands, and the United Kingdom, highlighting the complex geopolitical landscape that shapes the rules of cyber attribution.",
    "Technical Precision": "The second type of proposal is decentralised and scholars focus on establishing evidentiary standards (Dederer & Singer 2019; Ronen 2020). The argument is to maintain the existing decentralised system with multiple attributors and set evidentiary standards for attribution in a way that cross-checking is facilitated (Eichensehr 2019). These works reinforce the idea that national evidentiary standards rarely converge at the international level which hinders the development of international evidentiary standards."
}